
 <?php 
 
 //เมื่อทำการใส่โค้ด ผู้ใช้บริการ 02125---------------------
 
 
 	if($f_cash = 0 and $exbook = 0)//ถ้าหาค่าปรับเท่ากกับ 0 จากตารางคาปรับ และ หนังสือกำหนดคืนเกินเวลากำหนดเวลาเท่ากับ 0
		{
			
			// ไม่ต้องแสดงแจ้งเตือนและไม่มีค่าปรับในหน้าต่างค่าปรับ
			
			
			}
	else if($f_cash_use = 0 and $exbook = 1  )//ถ้าตารางค่าปรับยังไม่มี แต่  มีการยืมหนังสือเกินวันที่กำหนด
			{
				ทำการคำนวนค่าปรับพร้อม เงินสุทธิ insert ลงตารางค่าปรับและตารางซับค่าปรับ  ให้แสดงรายการที่หน้าจองโดยดึงข้อมูลจาก tb_exbook
				
				}
	else if($f_cash_use = 1 and $exbook = 1)// ให้อัพเดตค่าปรับใหม่ ที่ได้จากการคำนวนมาจาก tb exbook 
 	
 			{
				ทำการคำนวนค่าปรับใหม่จากตาราง tbexbook  แล้วทำการinsert ลงtb_fines
				
				}
 
 
  ?>